{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Masters of Applied Science",
      "department": "Applied Computer Science",
      "duration": "2021-2023",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Computer Science",
      "duration": "2015-2019",
      "school_name": "Sri Krishna College of Engineering and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SaghanaMaheshsarma",
  "highlighted_projects": [
    {
      "description": "Crafted an advanced Book Inventory System to streamline operations across multiple bookstores, offering dynamic inventory control for books with identical copies. The system proactively notifies customers upon stock depletion, enhancing user experience. Engineered with Node.js and leveraged the Knex ORM alongside a PostgreSQL database, ensuring a powerful and scalable solution for comprehensive book management.",
      "git_url": "https://github.com/saghanam/Bookzilla",
      "name": "Book Inventory System"
    },
    {
      "description": "Contributed to the development of an enterprise application catering to cosmetic companies' brands and vendor partners. Played a key role in designing and implementing features such as Tracking and Notification Delivery, ads, and warehouse management. Facilitated communication between clients and the sales team, analyzing products to improve delivery efficiency.",
      "name": "Seller Portal"
    },
    {
      "description": "Engineered an innovative Face Mask Detection System leveraging a convolutional neural network, trained on diverse datasets from Kaggle. Developed with proficiency in Python and cutting-edge AI frameworks, the system stands as a pivotal contribution to public health and safety, accurately discerning various face mask types. This project reflects a commitment to utilizing technology for societal well-being, showcasing my expertise in artificial intelligence and computer vision.",
      "git_url": null,
      "name": "Face Mask Detection System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Optimizing the efficient operation of a Linux cluster composed of numerous nodes/servers running CentOS 7, the Linux cluster monitoring agent aims to collect comprehensive hardware characteristics for each node and deliver real-time resource monitoring, encompassing CPU and memory data. Employing a reliable Relational Database Management System (RDBMS), the agent stores the data, empowering the Linux cluster management team to generate analytical reports for informed resource allocation.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_SaghanaMaheshsarma/tree/develop/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Executed a comprehensive exploration of SQL in the CD (Country Club) Database Project, demonstrating fluency in fundamental and advanced queries, including JOIN operations and aggregations with strings. These skills are applied to a dynamic dataset simulating a Country Club's membership system, facilities, and bookings. This project showcases a practical and nuanced understanding of SQL, underscoring its applicability in effective database management and analysis.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_SaghanaMaheshsarma/tree/develop/sql",
      "name": "Country Club Database Project"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Saghana Mahesh Sarma",
  "others": [
    {
      "bullets": [
        "Volunteer, inCyber: Passionate volunteer in cybersecurity and software development to stay updated on industry trends and foster a collaborative community",
        "Gaming :Enjoy strategic thinking and teamwork playing board games",
        "Creative Writing : Curating content for a photography page,showcasing a blend of creativity and effective communication skills"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Currently undergoing intensive training at Jarvis, immersing myself in diverse technical stacks.This dynamic learning environment is enhancing my skills in linux,bash,SQL, and I am excited to apply this knowledge to real-world scenarios in the near future.",
      "duration": "2023-Present",
      "title": "Software Developer"
    },
    {
      "company": "Codingmart Technologies",
      "description": "Developed and maintained end-to-end web applications, demonstrating fluency in both backend and frontend development. Created landing pages, dashboards, and web applications, involved in code reviewing, debugging, and fixing issues. Actively participated in the design and development processes to create an engaging experience for users using React JS. Developed robust and scalable web applications using Java, leveraging object-oriented principles and frameworks. Experienced in NodeJS using frameworks such as Express to deliver performant and scalable REST APIs. Assisted in the deployment and maintenance of production applications, ensuring high availability and scalability. Possess a working knowledge of microservices and server orchestration.",
      "duration": "2019-2021",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "HTML/CSS",
      "MongoDB",
      "Amazon Web Services(AWS,S3,Lambda)",
      "C"
    ],
    "familiar": [
      "C++",
      "Redis",
      "Docker,Kubernetes",
      "Kotlin",
      "Linux/Bash"
    ],
    "proficient": [
      "Java",
      "Javascript(React,Node.js)",
      "SQL,PostgreSQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "As a seasoned software developer with a Master of Science in Computer Science from Concordia University, I possess a combination of practical knowledge and rigorous academic principles. I have gained extensive experience in design patterns, Agile methodologies, and effective project management throughout my professional trajectory. The dynamic nature of the software industry and the prospect of skillfully resolving complex issues are two aspects that I find particularly exciting. I am passionate about ensuring an optimal user experience through innovative solutions and efficient debugging. My academic foundation, coupled with practical experience, fuels my enthusiasm for staying at the forefront of technology. I am eager to discuss how I can bring substantial value to your team's goals."
}
